In [150]:
import pandas as pd
import numpy as np

In [151]:
file_to_load = "Resources/purchase_data.csv"
purchase_data = pd.read_csv(file_to_load)

In [152]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [153]:
purchase_data.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [154]:
purchase_data.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

In [155]:
users_counts = purchase_data['SN'].value_counts()

In [156]:
users_counts_df = pd.DataFrame(users_counts)


rename_user = users_counts_df.rename(columns={"SN":"Player Count"})
rename_user

              Player Count
Lisosia93                5
Idastidru52              4
Iral74                   4
Zontibe81                3
Tyidaim51                3
...                    ...
Jiskjask85               1
Mindadaran26             1
Saena89                  1
Lisossa46                1
Iana95                   1

[576 rows x 1 columns]

In [157]:
player_count= rename_user.count()
print(player_count)

grouped_pc = purchase_data.groupby(['SN'])
grouped_pc.count().head()

Player Count    576
dtype: int64

              Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adairialis76            1    1       1        1          1      1
Adastirin33             1    1       1        1          1      1
Aeda94                  1    1       1        1          1      1
Aela59                  1    1       1        1          1      1
Aelaria33               1    1       1        1          1      1

In [158]:
avg_sale = purchase_data['Price'].mean()
total_sales = purchase_data['Purchase ID'].count()
total_profit = purchase_data['Price'].sum()
unique_items_ct = purchase_data['Item Name'].value_counts()
num_unique_items = unique_items_ct.count()
print(f"Avg sales price is ${avg_sale} total items sold {total_sales} and total profit is  ${total_profit} ")

Avg sales price is $3.050987179487176 total items sold 780 and total profit is  $2379.77

In [169]:
total_profit

2379.77

In [160]:
training_df = pd.DataFrame({
    "Unqiue Items":num_unique_items,
    "Avg Price":avg_sale,
    "Number of Purchases":total_sales,
    "Total Revenue": ["Fix"]
})
training_df
#total_sales_df = pd.DataFrame(total_sales)
#total_sales_df

   Unqiue Items  Avg Price  Number of Purchases Total Revenue
0           179   3.050987                  780           Fix

In [190]:
grouped_gender = purchase_data.groupby('Gender')['SN'].nunique()
avg_gender = (grouped_gender / 576.00) * 100.00
#grouped_gender

avg_gender

Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722
Name: SN, dtype: float64

In [193]:
gd_df = pd.DataFrame({
    "Total Count": grouped_gender,
    "Percentage of Players": avg_gender
})

gd_df

                       Total Count  Percentage of Players
Gender
Female                          81              14.062500
Male                           484              84.027778
Other / Non-Disclosed           11               1.909722

In [185]:
gender2 =purchase_data.groupby('Gender')['Price']
pc = gender2.count()
app = gender2.mean()
tpv = gender2.sum()
atpp = tpv / grouped_gender
atpp

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [198]:
gender_pur_df = pd.DataFrame({
    "Gender":grouped_gender,
    "Purchase Count":pc,
    "Average Purchase Price":app,
    "Total Purchase Value": tpv,
    "Avg Total Purchase per Person": atpp
})
gender_pur_df

,Gender,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,,
Female,81,113,3.203009,361.94,4.468395
Male,484,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,11,15,3.346000,50.19,4.562727